app/views/posts/index.html.erb

SELECT "posts".* FROM "posts"
---
<script type="text/javascript" charset="utf-8">
  $(function() {
    $(".js-more").on('click', function() {
      // get the id from the data attribute
      let id = $(this).data("id");
      $.get("/posts/" + id + "/body", function(data) {
        // Replace text of body-id div
        $("post-" + id).text(data);
      });
    });
  });